#ifndef FOODMENU_H
#define FOODMENU_H

#include <QString>
#include <QVector>

struct food {
    food(QString _name = "", qreal _price = 0, qreal _waitTime = 0) :
        name(_name), price(_price), waitTime(_waitTime) {};
    QString name;   // 菜品名
    qreal price;    // 价格
    qreal waitTime; // 制作时间
};

const food brackfast[] = { {"馒头",0.5,0.5},{"鸡蛋",1.0,0.5},{"肉包子",2.5,0.5},{"手抓饼",4,2},{"年糕",4,3},{"番茄鸡蛋饼",3,2.5},{"小笼包(每笼4个)",3,2.0},	// 中式早餐
                           {"皮蛋瘦肉粥",3.0,2.0},{"豆浆",2.0,0.5},{"牛奶",3.0,1.0},{"酸奶紫薯泥",6,5},	// 粥
                           {"香肠吐司披萨",6,3},{"金枪鱼&虾仁寿司",5,2.0},{"吐司面包",2.5,1.0},	// 西式早餐
                           {"羊杂汤(小)",10,8},{"羊杂汤(大)",13,8},	// 汤
                           {"三文鱼芦笋蘑菇面",10,6},{"蔬菜沙拉",8,6},{"咖喱蛋包饭",12,8},{"福建千里香混沌",8,6} };	// 主食
const food lunch[] = { {"鱼香肉丝",9,5},{"宫保鸡丁",10,5},{"大盘鸡（单人份）",9.8,6},{"黄焖鸡",12,7},{"梅菜扣肉",18,8},
                       {"土豆牛肉",18,8},{"照烧鸡肉",16,7},{"红烧茄子",13,6},{"香菇鸡块",16,7},{"口水鸡",16,7},	// 炒菜
                       {"炒面",7,4},{"烩面",9,4},{"水饺",10,4},{"羊肉水饺",12,5},{"牛肉水饺",12,5},
                       {"馄饨",10,5} };	// 主食
const food dinner[] = { {"皮蛋瘦肉粥",7.9,0.5},{"田园蔬菜粥",4.9,0.5},{"香菇瘦肉粥",8.9,0.5},{"青菜瘦肉粥",6.9,0.5},
                        {"番茄牛肉粥",9.9,0.5},{"山药瘦肉粥",8.9,0.5},{"绵绵豆汤粥",6.9,0.5},{"青椒肉丝",9.9,4.0},
                        {"孜然肉片",11.8,5.0},{"鱼香肉丝",9.8,4.5},{"川香回锅肉",15.8,6.0},{"麻婆豆腐",6.8,4.0},{"番茄鸡蛋",8.8,3.5},
                        {"馒头",2,0.5},{"大米",2,0.5},{"汤面条",3,0.5},
                        {"酸梅汤",3,0.5},{"芬达",3,0.5},{"雪碧",3,0.5} };

#endif // FOODMENU_H
